app/controllers/api/answers_controller.rb

    def index
        @answers = Answer.all.includes(:user, :votes).select{|a| a.question_id = params[:answer][:question_id]}
---
SELECT "answers".* FROM "answers"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 15], ["id", 18]]

    def create
        @answer = current_user.answers.new(answer_params)
        if @answer.save
---
INSERT INTO "answers" ("body", "author_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "gvgdfdfdfgvffdfvfvdbgvfbgbgfgfnfhnhnhghnhn"], ["author_id", 19], ["question_id", 16], ["created_at", "2020-08-04 15:00:48.803868"], ["updated_at", "2020-08-04 15:00:48.803868"]]

    def show

        @answer = Answer.includes(:user, :question, :votes).find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1  [["id", 17]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 19]]

    def update

        @answer = Answer.find(params[:id])
        if @answer

            if @answer.update(answer_params)
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "answers" SET "body" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["body", "gvgdfdfdfgvffdfvfvdbgvfbgbgfgfnfhnhnhghn"], ["updated_at", "2020-08-04 19:26:58.898659"], ["id", 16]]

    def destroy
        @answer = Answer.find(params[:id])
        @answer.destroy!
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 20]]