app/controllers/api/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE (LOWER(title) LIKE '%redux%' or LOWER(body) LIKE '%redux%')
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 7], ["id", 20]]
---
    def index
        @questions = Question.all.includes(:user)

INSERT INTO "questions" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create

        @question = current_user.questions.new(question_params)
        if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 16]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
    def show
        @question = Question.includes(:user, :answers).find(params[:id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["body", "gfdgdfvgfvffdvgdcffvfvfvdxcdfvxcdfcdxcfvdscfxsdzaxsxdzasxzasaxzsaxZszxasxzdasxdsxdzsxzdasxzszxa"], ["updated_at", "2020-08-01 16:13:20.168526"], ["id", 18]]
---
    def update

        @question = Question.find(params[:id])
        if @question

            if @question.update(question_params)
                render :show
            else
                errors ={}
                @question.errors.each do |attribute, message|

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 26]]
---
    def destroy
        @question = Question.find(params[:id])
        @question.destroy!