app/controllers/api/sessions_controller.rb

    def create

        @user = User.find_by_credentials(
            params[:user][:email],
            params[:user][:password]
        )

        if @user
            login!(@user)
            render "/api/users/show", status: 200
        else
            errors = {}
            message =''

            if params[:user][:email].length == 0 || params[:user][:password].length == 0
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test3@gmail.com"], ["LIMIT", 1]]