app/controllers/api/votes_controller.rb

    def update_vote(new_value)

        if params[:answer_id].present?
            @answer = Answer.find(params[:answer_id])
            @vote = @answer.votes.where(user_id: current_user.id).first
            if @vote
                if @vote.value == new_value
                    @vote.destroy!
                else
                    @vote.update_attribute(:value, new_value)
                end
            else
                @vote = current_user.votes.create({value: new_value, voteable: @answer})
            end
            render '/api/answers/show'
        elsif params[:question_id].present?
            @question = Question.includes(:user, :answers, :votes).find(params[:question_id])
            @vote = @question.votes.where(user_id: current_user.id).first
            if @vote
                if @vote.value == new_value
                    @vote.destroy!
                else
                    @vote.update_attribute(:value, new_value)
                end
            else
                @vote = current_user.votes.create({value: new_value, voteable: @question})
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = $1  [["id", 5]]
UPDATE "votes" SET "value" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["value", -1], ["updated_at", "2020-08-06 01:17:14.514649"], ["id", 10]]
INSERT INTO "votes" ("value", "user_id", "voteable_id", "voteable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["value", 1], ["user_id", 21], ["voteable_id", 16], ["voteable_type", "Question"], ["created_at", "2020-08-05 22:31:48.596161"], ["updated_at", "2020-08-05 22:31:48.596161"]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 16]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 7]]
DELETE FROM "votes" WHERE "votes"."id" = $1  [["id", 17]]
INSERT INTO "votes" ("value", "user_id", "voteable_id", "voteable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["value", 1], ["user_id", 21], ["voteable_id", 16], ["voteable_type", "Question"], ["created_at", "2020-08-06 02:21:25.927420"], ["updated_at", "2020-08-06 02:21:25.927420"]]