app/views/api/questions/index.json.jbuilder

json.users do
    @questions.includes(:user).each do |question|
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 7], ["id", 16]]