app/views/api/questions/index.json.jbuilder

            json.votes question.points
            json.answers question.answers.count
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 16]]