app/views/api/questions/show.json.jbuilder

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 16]]
---
json.answers do
    @question.answers.each do |answer|

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 16]]
---
    end
    @question.answers.each do |answer|