app/views/api/answers/index.json.jbuilder

    json.set! @answers[0].question_id do
        json.partial! 'api/questions/question', question: @answers.first.question
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]